{
    "template_0": {
        "template_id": 0,
        "seedq": "What are the similar courses?",
        "utterances": [
            "What are some similar courses to <COURSE_NAME>?",
            "most similar courses <COURSE_NAME>",
            "Can you suggest any courses that are similar to <COURSE_NAME>?",
            "I'm interested in <COURSE_NAME>, what other courses should I consider?",
            "Can you recommend any other courses that are like <COURSE_NAME>?",
            "Are there any related courses to <COURSE_NAME> that I should check out?",
            "Can you suggest any complementary courses to <COURSE_NAME>?",
            "What are some other courses in the same field as <COURSE_NAME>?",
            "Are there any other courses that would be a good fit for someone who's interested in <COURSE_NAME>?",
            "Can you recommend any courses that have a similar curriculum to <COURSE_NAME>?",
            "What are some other courses that cover similar material as <COURSE_NAME>?",
            "Are there any other courses that have a similar focus as <COURSE_NAME>?",
            "Can you suggest any other classes that are similar to <COURSE_NAME>?",
            "Are there any other programs that are similar to <COURSE_NAME>?",
            "Can you recommend any other training programs that are like <COURSE_NAME>?",
            "What are some other educational opportunities that are similar to <COURSE_NAME>?",
            "Are there any other workshops that are similar to <COURSE_NAME>?",
            "Can you suggest any other lectures that are similar to <COURSE_NAME>?",
            "Are there any other seminars that are similar to <COURSE_NAME>?",
            "Can you recommend any other webinars that are like <COURSE_NAME>?",
            "What are some other online courses that are similar to <COURSE_NAME>?",
            "Are there any other distance learning programs that are similar to <COURSE_NAME>?",
            "Can you suggest any other self-paced courses that are similar to <COURSE_NAME>?",
            "Are there any other MOOCs that are similar to <COURSE_NAME>?",
            "Can you recommend any other e-learning programs that are like <COURSE_NAME>?",
            "What are some other degree programs that are similar to <COURSE_NAME>?",
            "Are there any other certification programs that are similar to <COURSE_NAME>?",
            "Can you suggest any other professional development courses that are similar to <COURSE_NAME>?",
            "Are there any other continuing education courses that are similar to <COURSE_NAME>?",
            "Can you recommend any other graduate programs that are like <COURSE_NAME>?",
            "What are some other postgraduate programs that are similar to <COURSE_NAME>?",
            "Are there any other doctoral programs that are similar to <COURSE_NAME>?",
            "Can you suggest any other master's programs that are similar to <COURSE_NAME>?",
            "Are there any other undergraduate programs that are similar to <COURSE_NAME>?",
            "Can you recommend any other vocational programs that are like <COURSE_NAME>?",
            "What are some other technical programs that are similar to <COURSE_NAME>?",
            "Are there any other trade programs that are similar to <COURSE_NAME>?",
            "Are there any other internship programs that are similar to <COURSE_NAME>?",
            "Can you recommend any other fellowship programs that are like <COURSE_NAME>?",
            "Are there any other electives that are similar to <COURSE_NAME>?",
            "<COURSE_NAME> simillar courses",
            "similar to <COURSE_NAME> what are the courses",
            "alternatives for <COURSE_NAME> in cu boulder",
            "similar coursework to <COURSE_NAME>, or <COURSE_NAME>?",
            "What are the similar courses to <COURSE_NAME> offered this semester?",
            "Are there any courses that cover similar topics to <COURSE_NAME>?",
            "Can you recommend any other courses that are similar to <COURSE_NAME>?",
            "Are there any prerequisites for <COURSE_NAME> that are covered in similar courses?",
            "I'm interested in <COURSE_NAME>, are there any similar courses that are available online?",
            "Do any of the other courses cover similar materials to <COURSE_NAME>?",
            "Are there any courses that follow the same teaching style as <COURSE_NAME>?",
            "Are there any other courses with similar workload and level of difficulty as <COURSE_NAME>?",
            "Can you suggest any courses that complement <COURSE_NAME>?",
            "I'm interested in <COURSE_NAME>, what other courses should I consider taking alongside it?",
            "Are there any courses that build on the topics covered in <COURSE_NAME>?",
            "Are there any courses that offer a different perspective on the topics covered in <COURSE_NAME>?",
            "Are there any courses that are prerequisites for <COURSE_NAME> and cover similar material?",
            "Are there any courses that are prerequisites for <COURSE_NAME> and complement the material covered?",
            "I'm interested in <COURSE_NAME>, are there any courses that are a good follow-up to it?",
            "Can you recommend any other courses that are at the same level of difficulty as <COURSE_NAME>?",
            "What other courses are available that focus on a similar subject matter as <COURSE_NAME>?",
            "Can you recommend any other courses that are of a similar length to <COURSE_NAME>?",
            "I'm looking for courses that cover the same material as <COURSE_NAME>, what are my options?",
            "What other courses are taught by the same instructor as <COURSE_NAME>?",
            "What other courses are offered in the same department as <COURSE_NAME>?",
            "What other courses are offered in the same college as <COURSE_NAME>?",
            "What other courses are offered in the same field of study as <COURSE_NAME>?",
            "Can you suggest any courses that are similar to <COURSE_NAME> but at a lower level of difficulty?",
            "Are there any courses that cover similar material to <COURSE_NAME> but at a higher level of difficulty?",
            "Are there any courses that cover similar material to <COURSE_NAME> but with a more hands-on approach?",
            "Are there any courses that cover similar material to <COURSE_NAME> but with a more theoretical approach?",
            "Can you suggest any courses that cover similar material to <COURSE_NAME> but with a more interdisciplinary approach?",
            "I'm interested in <COURSE_NAME>, are there any courses that cover similar material but with a different regional focus?",
            "Are there any courses that cover similar material to <COURSE_NAME> but with a different historical focus?",
            "Are there any courses that cover similar material to <COURSE_NAME> but with a different cultural focus?",
            "Can you suggest any courses that cover similar material to <COURSE_NAME> but with a more contemporary focus?",
            "What other courses are available that focus on the same methodologies as <COURSE_NAME>?",
            "Are there any courses that cover similar material to <COURSE_NAME> but with a more practical focus?",
            "Are there any courses that cover similar material to <COURSE_NAME> but with a more research-oriented focus?",
            "I'm interested in <COURSE_NAME>, are there any courses that cover similar material but with a more quantitative approach?"
        ]
    },
    "template_1": {
        "template_id": 1,
        "seedq": "What are the alternative courses?",
        "utterances": [
            "Can you recommend some <COURSE_NAME> options for me?",
            "What other <COURSE_NAME> are available for me to consider?",
            "Are there any <COURSE_NAME> courses that are comparable to this one?",
            "What <COURSE_NAME> would you suggest as an alternative to this course?",
            "Could you provide me with some <COURSE_NAME> that cover similar material?",
            "Do you have any recommendations for <COURSE_NAME> related to this topic?",
            "What <COURSE_NAME> would you suggest I take instead of this one?",
            "Are there any <COURSE_NAME> that are more advanced than this one?",
            "What <COURSE_NAME> would you recommend for someone with prior knowledge of this subject?",
            "Can you suggest any <COURSE_NAME> that are more beginner-friendly?",
            "Are there any <COURSE_NAME> that are more practical in nature?",
            "What other <COURSE_NAME> are available that are more theoretical in nature?",
            "Can you recommend any <COURSE_NAME> that have a more hands-on approach?",
            "What <COURSE_NAME> would you suggest for someone looking for a more in-depth study of this topic?",
            "Could you suggest any <COURSE_NAME> that are more focused on real-world applications?",
            "What <COURSE_NAME> are available that focus on a specific aspect of this topic?",
            "Can you recommend any <COURSE_NAME> that provide a more general overview of this subject?",
            "What <COURSE_NAME> would you suggest for someone with a limited budget?",
            "Are there any <COURSE_NAME> that are free or low-cost?",
            "Can you recommend any <COURSE_NAME> that are self-paced?",
            "What <COURSE_NAME> are available that are instructor-led?",
            "What <COURSE_NAME> are available that are available online?",
            "Can you recommend any <COURSE_NAME> that have a flexible schedule?",
            "What <COURSE_NAME> would you suggest for someone looking for a shorter course?",
            "Are there any <COURSE_NAME> that are longer in duration?",
            "Can you suggest any <COURSE_NAME> that are more intensive?",
            "What <COURSE_NAME> would you recommend for someone with a busy schedule?",
            "Are there any <COURSE_NAME> that have a slower pace?",
            "Can you recommend any <COURSE_NAME> that are more interactive?",
            "What <COURSE_NAME> are available that have a more lecture-based format?",
            "Can you suggest any <COURSE_NAME> that provide a lot of practice exercises?",
            "What <COURSE_NAME> would you recommend for someone who wants to focus on the mathematical side of this topic?",
            "Are there any <COURSE_NAME> that provide a lot of real-world examples?",
            "Can you recommend any <COURSE_NAME> that are more research-oriented?",
            "What <COURSE_NAME> are available that are more project-based?",
            "Can you suggest any <COURSE_NAME> that provide a lot of one-on-one support?",
            "What <COURSE_NAME> would you recommend for someone looking for a community-based learning experience?",
            "Are there any <COURSE_NAME> that are geared towards a specific industry or application area?",
            "Can you recommend any <COURSE_NAME> that offer certification upon completion?",
            "What <COURSE_NAME> are available that have a global reputation or recognition?",
            "What <COURSE_NAME> would you suggest for someone who wants to learn more about the history of this topic?",
            "Can you recommend any <COURSE_NAME> that focus on the future trends of this subject?",
            "What <COURSE_NAME> are available that cover the ethics and social impact of this topic?",
            "Can you suggest any <COURSE_NAME> that provide a lot of case studies?",
            "What <COURSE_NAME> would you recommend for someone who wants to learn more about the practical applications of this topic?",
            "Are there any <COURSE_NAME> that focus specifically on the software development aspects of this subject?",
            "Can you recommend any <COURSE_NAME> that provide a lot of technical depth?",
            "What <COURSE_NAME> are available that have a strong emphasis on data analysis and visualization?",
            "What <COURSE_NAME> would you suggest for someone who wants to gain a broader understanding of this topic?",
            "Can you recommend any <COURSE_NAME> that are suitable for those with non-technical backgrounds?",
            "What <COURSE_NAME> are available that cover the theoretical foundations of this subject?",
            "What <COURSE_NAME> would you recommend for someone who wants to learn more about the cutting-edge research in this field?",
            "Can you suggest any <COURSE_NAME> that are more specialized?",
            "What <COURSE_NAME> are available that have a strong emphasis on collaboration and teamwork?",
            "What <COURSE_NAME> would you recommend for someone who wants to become an expert in this field?",
            "Can you recommend any <COURSE_NAME> that provide a lot of opportunities for networking and connecting with peers?",
            "What <COURSE_NAME> are available that are tailored to different learning styles?",
            "What <COURSE_NAME> would you suggest for someone who wants to learn at their own pace?",
            "Can you recommend any <COURSE_NAME> that provide a lot of feedback and assessment?",
            "What <COURSE_NAME> are available that are designed for different levels of expertise?",
            "What <COURSE_NAME> would you recommend for someone who wants to learn more about the business side of this field?",
            "Can you suggest any <COURSE_NAME> that provide a lot of hands-on experience?",
            "What <COURSE_NAME> are available that cover the practical implementation of this subject?",
            "What <COURSE_NAME> would you suggest for someone who wants to gain a deeper understanding of the math behind this topic?",
            "Can you recommend any <COURSE_NAME> that provide a lot of real-world examples and case studies?",
            "What <COURSE_NAME> are available that are designed for self-learners?",
            "What <COURSE_NAME> would you recommend for someone who wants to learn how to teach this subject?",
            "Can you suggest any <COURSE_NAME> that cover the legal and regulatory aspects of this field?",
            "What <COURSE_NAME> are available that are focused on the international landscape of this topic?",
            "What <COURSE_NAME> would you recommend for someone who wants to gain a more global perspective on this field?",
            "Can you recommend any <COURSE_NAME> that are focused on cutting-edge technologies in this field?",
            "What <COURSE_NAME> are available that are designed for entrepreneurs and start-up founders in this field?",
            "What <COURSE_NAME> would you suggest for someone who wants to become a thought leader in this field?",
            "Can you suggest any <COURSE_NAME> that focus on using this technology for social good and impact?",
            "What <COURSE_NAME> are available that cover the ethical considerations of this subject?",
            "What <COURSE_NAME> would you recommend for someone who wants to learn how to apply this technology to the healthcare industry?",
            "Can you suggest any <COURSE_NAME> that focus on the integration of this technology with other fields such as finance or marketing?",
            "What <COURSE_NAME> are available that cover the impact of this technology on society and culture?",
            "What <COURSE_NAME> would you suggest for someone who wants to learn about the current and future job opportunities in this field?",
            "Can you recommend any <COURSE_NAME> that provide certification or accreditation in this subject area?"
        ]
    },
    "template_2": {
        "template_id": 2,
        "seedq": "What are the prerequisite courses?",
        "utterances": [
            "What <COURSE_NAME> do I need to take before this course?",
            "Are there any prerequisite <COURSE_NAME> for this course?",
            "Can you tell me what <COURSE_NAME> are required for this course?",
            "What <COURSE_NAME> do I need to have completed to enroll in this course?",
            "Are there any recommended <COURSE_NAME> for this course?",
            "What are the required <COURSE_NAME> for this course?",
            "Can you provide a list of <COURSE_NAME> I need to have taken before this course?",
            "What <COURSE_NAME> do I need to know before starting this course?",
            "Do I need to have any specific <COURSE_NAME> to enroll in this course?",
            "What are the recommended <COURSE_NAME> to take before this course?",
            "What are the core <COURSE_NAME> to have a good foundation for this course?",
            "Can you suggest any <COURSE_NAME> to prepare for this course?",
            "What are the essential <COURSE_NAME> to have a solid understanding of the subject matter?",
            "Can you recommend any <COURSE_NAME> that would be useful to take before this course?",
            "What <COURSE_NAME> should I complete to be well-prepared for this course?",
            "Are there any advanced <COURSE_NAME> I should have taken before enrolling in this course?",
            "What <COURSE_NAME> are necessary to understand the content of this course?",
            "What <COURSE_NAME> would be helpful to have under my belt before taking this course?",
            "Do I need to have completed any <COURSE_NAME> before taking this course?",
            "What <COURSE_NAME> are important for me to understand before starting this course?",
            "What <COURSE_NAME> would you recommend to have a solid foundation for this course?",
            "Can you suggest any <COURSE_NAME> that would complement this course?",
            "What are the recommended <COURSE_NAME> to have a good understanding of the concepts covered in this course?",
            "Can you provide a list of <COURSE_NAME> that are prerequisites for this course?",
            "What <COURSE_NAME> should I have completed to be ready for this course?",
            "What <COURSE_NAME> are necessary to have a complete understanding of the material covered in this course?",
            "What <COURSE_NAME> do I need to have a good grasp of before enrolling in this course?",
            "Are there any <COURSE_NAME> I need to have taken to meet the prerequisites of this course?",
            "Can you recommend any <COURSE_NAME> to take to prepare for this course?",
            "What <COURSE_NAME> should I have taken before taking this course to be successful?",
            "What <COURSE_NAME> should I have completed to have a good background for this course?",
            "Can you provide a list of recommended <COURSE_NAME> to take before enrolling in this course?",
            "What <COURSE_NAME> are important to have a solid foundation before taking this course?",
            "What <COURSE_NAME> are required to understand the content covered in this course?",
            "Can you suggest any <COURSE_NAME> that will help me prepare for the subject matter in this course?",
            "What <COURSE_NAME> do I need to have completed to have the necessary background for this course?",
            "What <COURSE_NAME> would be beneficial to have taken before starting this course?",
            "Can you recommend any <COURSE_NAME> that would be useful to take concurrently with this course?",
            "What <COURSE_NAME> are expected to be completed before starting this course?",
            "What <COURSE_NAME> are necessary for understanding the advanced concepts in this course?",
            "Can you suggest any <COURSE_NAME> that would complement my understanding of the subject covered in this course?",
            "What <COURSE_NAME> should I have completed to have the prerequisites required for this course?",
            "What <COURSE_NAME> would be useful to take after completing this course?",
            "What <COURSE_NAME> do you recommend to gain the necessary skills for this course?",
            "Can you recommend any <COURSE_NAME> that would help me to better understand the subject matter in this course?",
            "What <COURSE_NAME> should I have taken to be adequately prepared for this course?",
            "Are there any <COURSE_NAME> that are highly recommended for this course?",
            "Can you provide a list of <COURSE_NAME> that are recommended to be taken before enrolling in this course?",
            "What <COURSE_NAME> should I have a good grasp of to do well in this course?",
            "What <COURSE_NAME> are necessary for building a strong foundation in this field?",
            "Can you suggest any <COURSE_NAME> that will help me to prepare for the material covered in this course?",
            "What <COURSE_NAME> are required for this course that I may not have covered?",
            "What <COURSE_NAME> are crucial for understanding the basic concepts in this course?",
            "Can you recommend any <COURSE_NAME> that would be useful to take in conjunction with this course?",
            "What <COURSE_NAME> would be helpful to take to supplement my understanding of this course?",
            "Are there any <COURSE_NAME> that I should be comfortable with before starting this course?",
            "What <COURSE_NAME> would you suggest to be taken concurrently with this course?",
            "What <COURSE_NAME> would be useful to take before or after this course for a better understanding of the subject?",
            "What <COURSE_NAME> are important to have completed before taking advanced courses in this field?",
            "Can you suggest any <COURSE_NAME> that would help me to build a solid foundation in this field?",
            "What <COURSE_NAME> should I have completed to have a good understanding of the concepts covered in this course?",
            "What <COURSE_NAME> would be beneficial to take to enhance my knowledge in this subject?",
            "Can you provide a list of <COURSE_NAME> that are prerequisites for this course?",
            "What <COURSE_NAME> are important to have a comprehensive understanding of the subject matter in this course?",
            "What <COURSE_NAME> are necessary for mastering the subject matter in this course?",
            "Can you suggest any <COURSE_NAME> that would prepare me for this course at an advanced level?",
            "What <COURSE_NAME> are required to have a solid foundation in this subject area?",
            "What <COURSE_NAME> should I have taken to be well-prepared for the coursework in this course?",
            "What <COURSE_NAME> would you recommend for those who want to take this course as an elective?",
            "Can you suggest any <COURSE_NAME> that would be helpful to take after completing this course?",
            "What <COURSE_NAME> are necessary to prepare for the advanced concepts covered in this course?",
            "What <COURSE_NAME> should I have completed to have a strong foundation in this subject area?",
            "Can you provide a list of <COURSE_NAME> that are highly recommended for this course?",
            "What <COURSE_NAME> are required to understand the practical applications of the subject in this course?",
            "What <COURSE_NAME> would be useful for someone who has a basic understanding of the subject matter but wants to delve deeper?",
            "Can you recommend any <COURSE_NAME> that would be useful for understanding the mathematical concepts in this course?",
            "What <COURSE_NAME> should I have completed to have a good grasp of the terminology used in this course?",
            "What <COURSE_NAME> would be helpful to take if I want to explore a specific area of the subject covered in this course?",
            "Can you suggest any <COURSE_NAME> that would be helpful for someone who wants to work in the field after completing this course?",
            "What <COURSE_NAME> are recommended for someone who wants to pursue a career in this field?"
        ]
    },
    "template_3": {
        "template_id": 3,
        "seedq": "What are the related courses offered online?",
        "utterances": [
            "Is this <COURSE_NAME> available online?",
            "does <COURSE_NAME> provide a hybrid/online option?",
            "<COURSE_NAME> online?",
            "is <COURSE_NAME> online?",
            "Is this <COURSE_NAME> available hybrid?",
            "is <COURSE_NAME> hybrid?",
            "does <COURSE_NAME> hybrid?",
            "does <COURSE_NAME> provide a hybrid option?",
            "does <COURSE_NAME> provide a hybrid/remote option?",
            "Can you recommend any hybrid <COURSE_NAME> courses?",
            "does <COURSE_NAME> provide a remote option?",
            "is <COURSE_NAME> remote?",
            "Is this <COURSE_NAME> available remote?",
            "Can you recommend any remote <COURSE_NAME> courses?",
            "Can you recommend any online <COURSE_NAME> courses?",
            "What <COURSE_NAME> courses are available to take online?",
            "Where can I find online <COURSE_NAME> courses?",
            "Are there any reputable online <COURSE_NAME> courses?",
            "Which universities offer online <COURSE_NAME> courses?",
            "What is the cost of taking an online <COURSE_NAME> course?",
            "Are there any free online <COURSE_NAME> courses available?",
            "How long does an online <COURSE_NAME> course typically last?",
            "What is the syllabus for an online <COURSE_NAME> course?",
            "Do online <COURSE_NAME> courses offer certificates or credentials?",
            "What are the prerequisites for an online <COURSE_NAME> course?",
            "Are there any online <COURSE_NAME> courses for beginners?",
            "What are the best online <COURSE_NAME> courses for advanced learners?",
            "What are the most popular online <COURSE_NAME> courses?",
            "Can you tell me more about the instructors for online <COURSE_NAME> courses?",
            "What are the different formats for online <COURSE_NAME> courses?",
            "What are the benefits of taking an online <COURSE_NAME> course?",
            "What are the drawbacks of taking an online <COURSE_NAME> course?",
            "How can I ensure the quality of an online <COURSE_NAME> course?",
            "Can I take an online <COURSE_NAME> course without an internet connection?",
            "What is the workload like for an online <COURSE_NAME> course?",
            "What are the assignments and assessments for an online <COURSE_NAME> course?",
            "What are the grading policies for online <COURSE_NAME> courses?",
            "Can I receive feedback on my work in an online <COURSE_NAME> course?",
            "Are there any online <COURSE_NAME> courses that offer live instruction or tutoring?",
            "What is the student-to-instructor ratio for online <COURSE_NAME> courses?",
            "Are online <COURSE_NAME> courses self-paced or structured?",
            "What is the level of interaction with other students in online <COURSE_NAME> courses?",
            "What are the online resources available for <COURSE_NAME> courses?",
            "Can I access online <COURSE_NAME> courses on my mobile device?",
            "Are there any online <COURSE_NAME> courses that require in-person attendance?",
            "What is the reputation of online <COURSE_NAME> courses in the job market?",
            "Are there any online <COURSE_NAME> courses that offer networking opportunities?",
            "What are the prerequisites for an online <COURSE_NAME> certification program?",
            "What is the time commitment for an online <COURSE_NAME> certification program?",
            "What is the cost of an online <COURSE_NAME> certification program?",
            "What are the benefits of obtaining an online <COURSE_NAME> certification?",
            "What are the different levels of online <COURSE_NAME> certification?",
            "Can I use an online <COURSE_NAME> certification to advance my career?",
            "How do online <COURSE_NAME> courses compare to traditional classroom courses?",
            "What are the prerequisites for an online <COURSE_NAME> degree program?",
            "Are there any fully online <COURSE_NAME> degree programs?",
            "What are the job prospects for graduates of online <COURSE_NAME> degree programs?",
            "What online resources are available to students in <COURSE_NAME> programs?",
            "What are the different specializations available in online <COURSE_NAME> programs?",
            "What is the accreditation status of online <COURSE_NAME> programs?",
            "Can I transfer credits from an online <COURSE_NAME> program to a traditional program?",
            "What are the financial aid options for online <COURSE_NAME> programs?",
            "What are the technological requirements for taking an online <COURSE_NAME> course?",
            "What is the difference between synchronous and asynchronous online <COURSE_NAME> courses?",
            "What is the student-to-student interaction like in online <COURSE_NAME> courses?",
            "What are the opportunities for internships or practical experience in online <COURSE_NAME> programs?",
            "What are the admission requirements for online <COURSE_NAME> programs?",
            "What is the average student age in online <COURSE_NAME> programs?",
            "What are the research opportunities in online <COURSE_NAME> programs?",
            "What is the career outlook for graduates of online <COURSE_NAME> programs?",
            "Are there any online <COURSE_NAME> courses or programs designed for working professionals?",
            "What is the format of online <COURSE_NAME> courses, including lectures and discussions?",
            "What are the technological platforms used in online <COURSE_NAME> courses?",
            "What is the quality of instruction in online <COURSE_NAME> courses compared to traditional courses?",
            "Are there any online <COURSE_NAME> courses that offer real-world case studies or projects?",
            "What is the average completion rate for online <COURSE_NAME> courses?",
            "What are the different career paths for graduates of online <COURSE_NAME> programs?",
            "What are the course materials required for online <COURSE_NAME> courses?",
            "Are there any online <COURSE_NAME> courses that offer a focus on research or publishing?",
            "What is the average class size for online <COURSE_NAME> courses?"
        ]
    },
    "template_4": {
        "template_id": 4,
        "seedq": "What are the related courses from the same department?",
        "utterances": [
            "<DEPT> courses",
            "courses <DEPT>",
            "courses from <DEPT>",
            "coursework from <DEPT>",
            "<DEPT> available courses",
            "courses in <DEPT>",
            "what are the courses available in <DEPT>?",
            "Courses provided by <DEPT>",
            "<DEPT> provides which courses?",
            "What are the related courses from the same <DEPT> department?",
            "Can you recommend any courses from the <DEPT> department that are related to this topic?",
            "Are there any prerequisites for the <DEPT> department courses that are related to this topic?",
            "What are some of the most popular courses offered by the <DEPT> department?",
            "Can you provide a list of courses that are related to the <DEPT> department?",
            "How many courses are offered by the <DEPT> department?",
            "Are there any online courses available from the <DEPT> department that are related to this topic?",
            "Are the courses offered by the <DEPT> department taught by experienced professors?",
            "What is the average class size for courses offered by the <DEPT> department?",
            "Are there any internships available through the <DEPT> department related to the courses offered?",
            "How often are the courses offered by the <DEPT> department?",
            "Can you tell me about the different course levels offered by the <DEPT> department?",
            "What are the prerequisites for taking a course in the <DEPT> department?",
            "Are there any co-requisite courses offered by the <DEPT> department that are related to this topic?",
            "Can you recommend any research opportunities available through the <DEPT> department related to the courses offered?",
            "How long are the courses offered by the <DEPT> department?",
            "Can you provide a list of textbooks used in courses offered by the <DEPT> department?",
            "Are there any distance learning courses offered by the <DEPT> department that are related to this topic?",
            "Can you tell me about the course structure for courses offered by the <DEPT> department?",
            "What is the credit hour requirement for courses offered by the <DEPT> department?",
            "Are there any certificate programs available through the <DEPT> department related to the courses offered?",
            "Can you tell me about the grading system for courses offered by the <DEPT> department?",
            "Are there any honors courses available through the <DEPT> department related to the courses offered?",
            "What are the office hours for professors teaching courses in the <DEPT> department?",
            "Can you recommend any extracurricular activities related to the courses offered by the <DEPT> department?",
            "Can you provide a list of academic resources available through the <DEPT> department?",
            "What are the requirements for graduation for courses offered by the <DEPT> department?",
            "Are there any scholarships available through the <DEPT> department related to the courses offered?",
            "Can you tell me about the research facilities available through the <DEPT> department?",
            "How are the courses offered by the <DEPT> department structured?",
            "Can you provide a list of elective courses offered by the <DEPT> department?",
            "What is the overall pass rate for courses offered by the <DEPT> department?",
            "Can you tell me about the average GPA for courses offered by the <DEPT> department?",
            "Are there any field trips or study abroad programs related to the courses offered by the <DEPT> department?",
            "Can you recommend any clubs or organizations related to the courses offered by the <DEPT> department?",
            "What are the tuition fees for courses offered by the <DEPT> department?",
            "Are there any financial aid programs available through the <DEPT> department related to the courses offered?",
            "Can you provide a list of prerequisites for advanced courses offered by the <DEPT> department?",
            "What is the class schedule for courses offered by the <DEPT> department?",
            "Can you tell me about the online course delivery format used by the <DEPT> department?",
            "What is the average duration of courses offered by the <DEPT> department?",
            "Can you provide information about the course materials for courses offered by the <DEPT> department?",
            "Are there any research papers or projects required for courses offered by the <DEPT> department?",
            "Can you provide a list of the most qualified instructors who teach courses offered by the <DEPT> department?",
            "What is the course load for students taking courses offered by the <DEPT> department?",
            "Can you tell me about the grading scale for courses offered by the <DEPT> department?",
            "Are there any prerequisite courses required for advanced courses offered by the <DEPT> department?",
            "What is the student-to-teacher ratio for courses offered by the <DEPT> department?",
            "Can you tell me about the admission requirements for taking courses offered by the <DEPT> department?",
            "What is the percentage of students who complete courses offered by the <DEPT> department?",
            "Can you recommend any tutoring or mentoring services offered by the <DEPT> department?",
            "What is the pass rate for students taking courses offered by the <DEPT> department?",
            "Can you provide a list of the research topics covered in courses offered by the <DEPT> department?",
            "What is the average class size for laboratory courses offered by the <DEPT> department?",
            "Can you tell me about the teaching philosophy of the <DEPT> department?",
            "What are the career opportunities for students who take courses offered by the <DEPT> department?",
            "Can you provide a list of scholarships and grants available to students taking courses offered by the <DEPT> department?",
            "What is the availability of teaching assistantships for students taking courses offered by the <DEPT> department?",
            "Can you tell me about the industry partnerships and collaborations of the <DEPT> department?",
            "What is the percentage of students who receive job offers after graduation from courses offered by the <DEPT> department?",
            "Can you provide a list of the equipment and resources available to students taking courses offered by the <DEPT> department?",
            "What is the success rate of students who participate in internship programs offered by the <DEPT> department?",
            "Can you tell me about the interdisciplinary connections of courses offered by the <DEPT> department?",
            "What is the percentage of students who pursue higher education after taking courses offered by the <DEPT> department?",
            "Can you provide a list of the course objectives for courses offered by the <DEPT> department?",
            "What is the accreditation status of the <DEPT> department?",
            "Can you tell me about the faculty development programs offered by the <DEPT> department?",
            "What is the percentage of international students who take courses offered by the <DEPT> department?",
            "Can you tell me about the pedagogical methods used by the <DEPT> department?",
            "What is the diversity percentage of students taking courses offered by the <DEPT> department?",
            "Can you provide a list of the learning outcomes for courses offered by the <DEPT> department?"
        ]
    }
}